//Задать номер четверти, показать диапазоны для возможных координат


Console.Write("Введите номер четверти: ");
int n = int.Parse(Console.ReadLine());

if (n == 1)  Console.WriteLine("x = (от '0' до бесконечности ); y = (от '0' до 'бесконечности')");

if (n == 2) Console.WriteLine("x = (от '- бесконечности' до '0'); y = (от '0' до 'бесконечности')");

if (n == 3) Console.WriteLine("x = (от '- бесконечности' до '0'); y = (от '- бесконечности' до '0')'");

if (n == 4) Console.WriteLine("X = (от '0' до 'бесконечности'); Y = (от '- бесконечности' до '0')");

if (n < 1 | n > 4) Console.WriteLine("Число n должно быть от 1 до 4");
